{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Blood Disorders",
    "1": "Cardiovascular Conditions",
    "2": "Digestive Issues",
    "3": "Ear Conditions",
    "4": "Eye Conditions",
    "5": "Genitourinary Conditions",
    "6": "Immune System Disorders",
    "7": "Infectious and Parasitic Diseases",
    "8": "Injury and Poisoning",
    "9": "Metabolic and Endocrine Disorders",
    "10": "Musculoskeletal Conditions",
    "11": "Neoplasms",
    "12": "Neurological and Behavioural Disorders",
    "13": "Reproductive Conditions",
    "14": "Respiratory Conditions",
    "15": "Skin Conditions"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Blood Disorders": 0,
    "Cardiovascular Conditions": 1,
    "Digestive Issues": 2,
    "Ear Conditions": 3,
    "Eye Conditions": 4,
    "Genitourinary Conditions": 5,
    "Immune System Disorders": 6,
    "Infectious and Parasitic Diseases": 7,
    "Injury and Poisoning": 8,
    "Metabolic and Endocrine Disorders": 9,
    "Musculoskeletal Conditions": 10,
    "Neoplasms": 11,
    "Neurological and Behavioural Disorders": 12,
    "Reproductive Conditions": 13,
    "Respiratory Conditions": 14,
    "Skin Conditions": 15
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.3",
  "vocab_size": 30522
}
